
🏗️ Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.supernode[0].netbox_available_ip_address.management_ipv6 will be created
  + resource "netbox_available_ip_address" "management_ipv6" {
      + description = "Management Address dev_0"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = 101
      + status      = "active"
    }

  # module.supernode[0].proxmox_vm_qemu.supernode will be created
  + resource "proxmox_vm_qemu" "supernode" {
      + additional_wait           = 0
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "c"
      + bootdisk                  = "virtio0"
      + clone                     = "debian12"
      + clone_wait                = 0
      + cloudinit_cdrom_storage   = "system"
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = false
      + desc                      = "Supernode v2 - dev_0"
      + force_create              = false
      + full_clone                = false
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = (known after apply)
      + kvm                       = true
      + memory                    = 1024
      + name                      = "supernode-dev_0"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "Supernodes2.0"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "pm2"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = 0
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "4G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "system"
          + storage_type       = (known after apply)
          + type               = "virtio"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + vga {
          + memory = 0
          + type   = "serial0"
        }
    }

  # module.supernode[1].netbox_available_ip_address.management_ipv6 will be created
  + resource "netbox_available_ip_address" "management_ipv6" {
      + description = "Management Address dev_1"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = 101
      + status      = "active"
    }

  # module.supernode[1].proxmox_vm_qemu.supernode will be created
  + resource "proxmox_vm_qemu" "supernode" {
      + additional_wait           = 0
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "c"
      + bootdisk                  = "virtio0"
      + clone                     = "debian12"
      + clone_wait                = 0
      + cloudinit_cdrom_storage   = "system"
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = false
      + desc                      = "Supernode v2 - dev_1"
      + force_create              = false
      + full_clone                = false
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = (known after apply)
      + kvm                       = true
      + memory                    = 1024
      + name                      = "supernode-dev_1"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "Supernodes2.0"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "pm2"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = 0
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "4G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "system"
          + storage_type       = (known after apply)
          + type               = "virtio"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + vga {
          + memory = 0
          + type   = "serial0"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```